#include <conio.h>
#include <iostream>
#include "1-MaC-File-01-Header.h"

using namespace std;


/*
 * Функция runInverseMatrix отвечает за:
 *  1. Ввод матрицы
 *  .
 *  2. Нахождение обратной матрицы.
 *  3. Вывод результата на экран.
 *  4. Очистку данных.
 * После того как функция завершит свою работу будет вызвана функция displayMatrixMenu.
 */
void runInverseMatrix()
{
    Matrix* matrixA;
    double* determinant;
    int n, m;

    cout
        << "|------------------------------------------------|" << endl
        << "|            >>> Обратная матрица <<<            |" << endl
        << "|------------------------------------------------|" << endl;

    do
    {
        do
        {
            cout << "| Введите кол-во строк матрицы: ";
            cin >> n;
        }
        while (n <= 0);

        cout << "|------------------------------------------------|" << endl;

        do
        {
            cout << "| Введите кол-во столбцов матрицы: ";
            cin >> m;
        }
        while (m <= 0);

        if (n != m) cout << "| Ошибка: Матрица должнабыть квадратной" << endl;

        cout << "|------------------------------------------------|" << endl;
    }
    while (n != m);

    cout
        << "|                Введите матрицу                 |" << endl
        << "|------------------------------------------------|" << endl;


    matrixA = enterMatrix(n, m);

    determinant = findDeterminant(matrixA);

    if (*determinant != 0)
    {
        matrixA = findInverseMatrix(matrixA, determinant);

        cout
            << "|------------------------------------------------|" << endl
            << "|                   Ответ                        |" << endl
            << "|------------------------------------------------|" << endl;

        printMatrix(matrixA);
    }

    else
    {
        cout
            << "|------------------------------------------------|" << endl
            << "|                   Ответ                        |" << endl
            << "|------------------------------------------------|" << endl
            << "|     Оперделитель матрицы равен нулю (0).       |" << endl
            << "|       Обратной матрицы не существует           |" << endl
            << "|------------------------------------------------|" << endl;

        delete determinant;
    }

    clearMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|      Нажмите любую клавишу чтобы продолжить    |" << endl
        << "|------------------------------------------------|" << endl;

    _getch();
    system("cls");
    displayMatrixMenu();
}
