#include <conio.h>
#include <iostream>
#include "1-MaC-File-01-Header.h"

using namespace std;

/*
 * Функция runSumMatrixToMatrix отвечает за:
 *  1. Ввод двух матриц.
 *  2. Сложение введенных матриц друг с другом.
 *  3. Вывод результата на экран.
 *  4. Очистку данных.
 * После того как функция завершит свою работу будет вызвана функция displayMatrixMenu.
 */
void runSumMatrixToMatrix()
{
    Matrix* matrixA;
    Matrix* matrixB;
    int n, m;

    cout
        << "|------------------------------------------------|" << endl
        << "|             >>> Сложение матриц <<<            |" << endl
        << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во строк матриц: ";
        cin >> n;
        if (n <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (n <= 0);

    cout << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во столбцов матриц: ";
        cin >> m;
        if (m <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (m <= 0);

    cout
        << "|------------------------------------------------|" << endl
        << "|            Введите первую матрицу              |" << endl
        << "|------------------------------------------------|" << endl;


    matrixA = enterMatrix(n, m);


    cout
        << "|------------------------------------------------|" << endl
        << "|            Введите вторую матрицу              |" << endl
        << "|------------------------------------------------|" << endl;

    matrixB = enterMatrix(n, m);

    sumMatrix(matrixA, matrixB);

    cout
        << "|------------------------------------------------|" << endl
        << "|                   Ответ                        |" << endl
        << "|------------------------------------------------|" << endl;

    printMatrix(matrixA);
    clearMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|      Нажмите любую клавишу чтобы продолжить    |" << endl
        << "|------------------------------------------------|" << endl;

    _getch();
    system("cls");
    displayMatrixMenu();
}


/*
 * Функция runSumMatrixToNumber отвечает за:
 *  1. Ввод числа и матрицы.
 *  2. Сложение (вычитание) матрицы и числа.
 *  3. Вывод результата на экран.
 *  4. Очистку данных.
 * После того как функция завершит свою работу будет вызвана функция displayMatrixMenu.
 */
void runSumMatrixToNumber()
{
    Matrix* matrixA;
    double* number = new double;
    int n, m;

    cout
        << "|------------------------------------------------|" << endl
        << "|        >>> Сложение матрицы с числом <<<       |" << endl
        << "|------------------------------------------------|" << endl;

    cout << "| Введите число: ";
    cin >> *number;
    cout << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во строк матрицы: ";
        cin >> n;
        if (n <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (n <= 0);

    cout << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во столбцов матрицы: ";
        cin >> m;
        if (m <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (m <= 0);

    cout
        << "|------------------------------------------------|" << endl
        << "|                Введите матрицу                 |" << endl
        << "|------------------------------------------------|" << endl;


    matrixA = enterMatrix(n, m);
    sumMatrix(matrixA, number);

    cout
        << "|------------------------------------------------|" << endl
        << "|                   Ответ                        |" << endl
        << "|------------------------------------------------|" << endl;

    printMatrix(matrixA);
    clearMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|      Нажмите любую клавишу чтобы продолжить    |" << endl
        << "|------------------------------------------------|" << endl;

    _getch();
    system("cls");
    displayMatrixMenu();
}


/*
 * Функция runSumMatrix отвечает за запуск необходимой функции сложения в зависимости от переданного значения key.
 * Если key == 0 то запускается функция сложения двух матриц runSumMatrixToMatrix.
 * Иначе - функция сложения числа с матрицей runSumMatrixToNumber.
 */
void runSumMatrix(bool key)
{
    if (key == 0) runSumMatrixToMatrix();
    else runSumMatrixToNumber();
}
