#include <conio.h>
#include <iostream>
#include "1-MaC-File-01-Header.h"

using namespace std;


/*
 * Функция runTranspositionMatrix отвечает за:
 *  1. Ввод матрицы.
 *  2. Транспонирование матрицы.
 *  3. Вывод результата на экран.
 *  4. Очистку данных.
 * После того как функция завершит свою работу будет вызвана функция displayMatrixMenu.
 */
void runTranspositionMatrix()
{
    Matrix* matrixA;
    int n, m;

    cout
        << "|------------------------------------------------|" << endl
        << "|        >>> Транспонирование матрицы <<<        |" << endl
        << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во строк матрицы: ";
        cin >> n;
        if (n <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (n <= 0);

    cout << "|------------------------------------------------|" << endl;

    do
    {
        cout << "| Введите кол-во столбцов матрицы: ";
        cin >> m;
        if (m <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
    }
    while (m <= 0);

    cout
        << "|------------------------------------------------|" << endl
        << "|                Введите матрицу                 |" << endl
        << "|------------------------------------------------|" << endl;


    matrixA = enterMatrix(n, m);
    matrixA = transpositionMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|                   Ответ                        |" << endl
        << "|------------------------------------------------|" << endl;

    printMatrix(matrixA);
    clearMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|      Нажмите любую клавишу чтобы продолжить    |" << endl
        << "|------------------------------------------------|" << endl;

    _getch();
    system("cls");
    displayMatrixMenu();
}
