#include <conio.h>
#include <iostream>
#include "1-MaC-File-01-Header.h"

using namespace std;


/*
 * Функция runDeterminantMatrix отвечает за:
 *  1. Ввод матрицы.
 *  2. Нахождение определителя матрицы.
 *  3. Вывод результата на экран.
 *  4. Очистку данных.
 * После того как функция завершит свою работу будет вызвана функция displayMatrixMenu.
 */
void runDeterminantMatrix()
{
    Matrix* matrixA;
    int n, m;
    double* determinant;

    cout
        << "|------------------------------------------------|" << endl
        << "|          >>> Определитель матрицы <<<          |" << endl
        << "|------------------------------------------------|" << endl;

    do
    {
        do
        {
            cout << "| Введите кол-во строк матрицы: ";
            cin >> n;
            if (n <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
        }
        while (n <= 0);

        cout << "|------------------------------------------------|" << endl;

        do
        {
            cout << "| Введите кол-во столбцов матрицы: ";
            cin >> m;
            if (m <= 0) cout << "| Ошибка: Введите целое положительное число" << endl;
        }
        while (m <= 0);

        if (n != m) cout << "| Ошибка: Матрица должнабыть квадратной" << endl;

        cout << "|------------------------------------------------|" << endl;
    }
    while (n != m);

    cout
        << "|                Введите матрицу                 |" << endl
        << "|------------------------------------------------|" << endl;


    matrixA = enterMatrix(n, m);
    determinant = findDeterminant(matrixA);
    clearMatrix(matrixA);

    cout
        << "|------------------------------------------------|" << endl
        << "|                   Ответ                        |" << endl
        << "|------------------------------------------------|" << endl;

    cout << "| Определитель матрицы: " << *determinant << endl;
    delete determinant;

    cout
        << "|------------------------------------------------|" << endl
        << "|      Нажмите любую клавишу чтобы продолжить    |" << endl
        << "|------------------------------------------------|" << endl;

    _getch();
    system("cls");
    displayMatrixMenu();
}
